# connect-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=a27f5636-438f-4b19-b110-9d75fb1c2982:connect]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-7d063032-f4b1-4e8e-b556-36c55ccb810e]
module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=a27f5636-438f-4b19-b110-9d75fb1c2982:connect_database_migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "connect"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "connect_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "a27f5636-438f-4b19-b110-9d75fb1c2982:connect_database_migration"
        name       = "connect_database_migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "25c78edb-66db-4277-a34f-a654e6a93ef7" -> "bfeb2b41-d215-4463-8aaa-631dc51e9308"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_deadletter_topic.upstash_kafka_topic.default will be created
  + resource "upstash_kafka_topic" "default" {
      + cleanup_policy   = "delete"
      + cluster_id       = (sensitive value)
      + creation_time    = (known after apply)
      + id               = (known after apply)
      + max_message_size = 1048576
      + multizone        = (known after apply)
      + partitions       = 1
      + password         = (sensitive value)
      + region           = (known after apply)
      + rest_endpoint    = (known after apply)
      + retention_size   = 1073741824
      + retention_time   = 259200000
      + state            = (known after apply)
      + tcp_endpoint     = (known after apply)
      + topic_id         = (known after apply)
      + topic_name       = "connect.v1.event.deadletter"
      + username         = (known after apply)
    }

  # module.common_resources.module.kafka_retry_topic[0].upstash_kafka_topic.default will be created
  + resource "upstash_kafka_topic" "default" {
      + cleanup_policy   = "delete"
      + cluster_id       = (sensitive value)
      + creation_time    = (known after apply)
      + id               = (known after apply)
      + max_message_size = 1048576
      + multizone        = (known after apply)
      + partitions       = 2
      + password         = (sensitive value)
      + region           = (known after apply)
      + rest_endpoint    = (known after apply)
      + retention_size   = 1073741824
      + retention_time   = 259200000
      + state            = (known after apply)
      + tcp_endpoint     = (known after apply)
      + topic_id         = (known after apply)
      + topic_name       = "connect.v1.event.retry.0"
      + username         = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*